In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import pickle
from sklearn import preprocessing

In [3]:
data = pd.read_csv('raw_salary_data.csv')

In [4]:
data.head()

,experience,aptitude_score,technical score,sql,python,html,spark,css,machine learning,avg_score,salary
0,three,9,5.0,3,4,5,2,3.0,9,32.125,60000
1,NaN,5,6.0,2,5,2,4,4.0,5,28.625,40000
2,two,7,7.0,4,4,3,2,NaN,6,27.750,45000
3,five,8,8.0,5,2,4,3,5.0,7,35.875,70000
4,six,10,9.0,5,3,4,4,4.0,8,40.000,80000

In [5]:
data.shape

(34, 11)

In [6]:
data.isnull().sum()

experience          7
 aptitude_score     0
technical score     1
sql                 0
python              0
html                0
spark               0
css                 1
machine learning    0
avg_score           0
salary              0
dtype: int64

In [7]:
data['experience'].fillna('zero',inplace=True)

In [8]:
data['css'].fillna(data['css'].median(), inplace=True)
data['technical score'].fillna(data['technical score'].median(), inplace=True)

In [9]:
data.isnull().sum()

experience          0
 aptitude_score     0
technical score     0
sql                 0
python              0
html                0
spark               0
css                 0
machine learning    0
avg_score           0
salary              0
dtype: int64

In [10]:
data.head()

,experience,aptitude_score,technical score,sql,python,html,spark,css,machine learning,avg_score,salary
0,three,9,5.0,3,4,5,2,3.0,9,32.125,60000
1,zero,5,6.0,2,5,2,4,4.0,5,28.625,40000
2,two,7,7.0,4,4,3,2,3.0,6,27.750,45000
3,five,8,8.0,5,2,4,3,5.0,7,35.875,70000
4,six,10,9.0,5,3,4,4,4.0,8,40.000,80000

In [11]:
from sklearn import preprocessing

In [12]:
le=preprocessing.LabelEncoder()

In [13]:
data['experience']=le.fit_transform(data['experience'])

In [14]:
data.head()

,experience,aptitude_score,technical score,sql,python,html,spark,css,machine learning,avg_score,salary
0,9,9,5.0,3,4,5,2,3.0,9,32.125,60000
1,11,5,6.0,2,5,2,4,4.0,5,28.625,40000
2,10,7,7.0,4,4,3,2,3.0,6,27.750,45000
3,2,8,8.0,5,2,4,3,5.0,7,35.875,70000
4,6,10,9.0,5,3,4,4,4.0,8,40.000,80000

In [15]:
X=data.drop('salary',axis=1)

y=data.pop('salary')

In [16]:
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split

In [17]:
X_train, X_test, y_train, y_test=train_test_split(X,y, test_size=.30,random_state=10)

In [18]:

model_lr=LinearRegression()

model_lr.fit(X_train,y_train)
model_lr.score(X_train,y_train)

0.8946513792600769

In [19]:
prediction=model_lr.predict(X_test)

In [20]:
model_lr.score(X_test,y_test)

-1.773424522922391

In [22]:
import pickle

In [28]:
pickle.dump(model_lr,open('hiring.pkl','wb'))

In [30]:
model = pickle.load(open('hiring.pkl','rb'))
result=model.predict(X_test)
print(result)

[49703.844112   65558.71632813 55000.15827772 44867.80251637
 37671.65453004 84704.28953154 77010.81998913 41762.86260533
 15995.09561121 79948.1704342  49938.60096562]